CanHaveTypeAssigned Method
Overload List
Name | Description
CanHaveTypeAssigned
 Identifies if the element can have a type assigned.
CanHaveTypeAssigned(Document, ICollectionElementId)
 Checks if all elements in the set can have a type assigned.
See Also
Element Class
Element Members
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →